#include <iostream>
#include "set.h"

int main() {
    setlocale(0, "");

    Set set1, set2;

    // тест операции ввода
    cout << "¬ведите множество 1: ";
    cin >> set1;
    cout << "¬ведите множество 2: ";
    cin >> set2;

    // тест операции вывода
    cout << "ћножество 1: " << set1 << endl;
    cout << "ћножество 2: " << set2 << endl;

    // тест операции доступа по индексу
    cout << "Ёлемент множества 1 с индексом 0: " << set1[0] << endl;

    // тест операции присваивани€
    Set set3 = set1;
    cout << "ћножество 3 (копи€ множества 1): " << set3 << endl;

    // тест операции проверки на равенство
    cout << "ћножество 1 равно множеству 2? " << (set1 == set2) << endl;

    // тест операции принадлежности числа множеству
    int number;
    cout << "¬ведите число: ";
    cin >> number;
    cout << number << " принадлежит множеству 1? " << (set1 > number) << endl;

    // тест класса-итератора
    Set::Iterator iter = set1.begin();
    cout << "ѕервый элемент множества 1: " << *iter << endl;
    ++iter;
    cout << "¬торой элемент множества 1: " << *iter << endl;
    --iter;
    cout << "—нова первый элемент множества 1: " << *iter << endl;

    return 0;
}